Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/edc/PIC32MM0256GPM028.PIC
      <edc:AdjustPoint edc:_addr="0x1FC017DC" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="SABD_32bit.DCRModule" edc:_refcount="1" edc:offset="0x4"/>
      <edc:DCRDef edc:_addr="0x1FC017E0" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="SABD_32bit.DCRModule" edc:_refcount="1" edc:access="n-------------------------------" edc:cname="FSIGN" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x80000000" edc:ishidden="true" edc:isidehidden="true" edc:islanghidden="true" edc:name="FSIGN" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="31"/>
            <edc:DCRFieldDef edc:cname="SIGN" edc:desc="" edc:ishidden="false" edc:isidehidden="false" edc:islanghidden="false" edc:mask="0x1" edc:name="SIGN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="Reserved" edc:desc="This bit must be programmed to zero" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:AltConfigFuseSector edc:beginaddr="0x1fc01740" edc:endaddr="0x1fc01768" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="altconfig" edc:regionidref="config" edc:registerprefix="A">
      <edc:AdjustPoint edc:_addr="0x1FC01740" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="SABD_32bit.DCRModule" edc:_refcount="1" edc:offset="0x4"/>
      <edc:DCRDef edc:_addr="0x1FC01744" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="SABD_32bit.DCRModule" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnn---------nn---" edc:cname="AFDEVOPT" edc:default="0xFFFFFFFF" edc:desc="" edc:factorydefault="0xFFFFFFFF" edc:impl="0xffffc018" edc:name="AFDEVOPT" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x0000FFFF">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="3"/>
            <edc:DCRFieldDef edc:cname="SOSCHP" edc:desc="Secondary Oscillator High Power Enable bit" edc:mask="0x1" edc:name="SOSCHP" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="SOSC oprerates in high power mode" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="SOSC oprerates in normal power mode." edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ALTI2C" edc:desc="Alternate I2C1 Pins Location Enable bit" edc:mask="0x1" edc:name="ALTI2C" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Alternate I2C1 pins are used" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Primary I2C1 pins are used" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:DCRFieldDef edc:cname="FUSBIDIO" edc:desc="USBID pin control" edc:mask="0x1" edc:name="FUSBIDIO" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="USBID pin is controlled by the port function" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="USBID pin is controlled by the USB module" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FVBUSIO" edc:desc="VBUS Pin Control" edc:mask="0x1" edc:name="FVBUSIO" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="VBUS pin is controlled by port function" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="VBUS pin is controlled by the USB module" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="USERID" edc:desc="User ID bits" edc:mask="0xffff" edc:name="USERID" edc:nzwidth="16">
              <edc:DCRFieldValueRange edc:cname="USERID" edc:desc="User ID bits" edc:max="0xffff" edc:min="0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC01748" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="SABD_32bit.DCRModule" edc:_refcount="1" edc:access="---------------------------nnnnn" edc:cname="AFICD" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x1f" edc:name="AFICD" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFC">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="DEBUG" edc:desc="Background Debugger Enable bits" edc:ishidden="true" edc:isidehidden="false" edc:islanghidden="true" edc:mask="0x3" edc:name="DEBUG" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Background debugger is enabled" edc:when="(field &amp; 0x2) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Background debugger is disabled" edc:when="(field &amp; 0x2) == 0x2"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="JTAGEN" edc:desc="JTAG Enable bit" edc:mask="0x1" edc:name="JTAGEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="JTAG is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="JTAG is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ICS" edc:desc="ICE/ICD Communication Channel Selection bits" edc:mask="0x3" edc:name="ICS" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="PGx1" edc:desc="Communicate on PGEC1/PGED1" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PGx2" edc:desc="Communicate on PGEC2/PGED2" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PGx3" edc:desc="Communicate on PGEC3/PGED3" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="NONE" edc:desc="Not connected" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC0174C" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="SABD_32bit.DCRModule" edc:_refcount="1" edc:access="----------------------------nnnn" edc:cname="AFPOR" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xf" edc:name="AFPOR" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xffffffff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="BOREN" edc:desc="Brown-out Reset Enable bits" edc:mask="0x3" edc:name="BOREN" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="BOR3" edc:desc="Brown-out Reset enabled in hardware; SBOREN bit disabled" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="BOR2" edc:desc="Brown-out Reset enabled only while device active and disabled in Sleep; SBOREN bit disabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="BOR1" edc:desc="Brown-out Reset controlled with the SBOREN bit setting" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="BOR0" edc:desc="Brown-out Reset disabled in hardware; SBOREN bit disabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RETVR" edc:desc="Retention Voltage Regulator Enable bit" edc:mask="0x1" edc:name="RETVR" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Retention regulator is enabled and controlled by RETEN bit during sleep" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Retention regulator is disabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LPBOREN" edc:desc="Downside Voltage Protection Enable bit" edc:mask="0x1" edc:name="LPBOREN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Low power BOR is enabled, when main BOR is disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Low power BOR is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
