Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/edc/PIC32MM0256GPM028.PIC
      <edc:DCRDef edc:_addr="0x1FC01754" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="SABD_32bit.DCRModule" edc:_refcount="1" edc:access="----------------nn-n-nnnnn-n-nnn" edc:cname="AFOSCSEL" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xd7d7" edc:name="AFOSCSEL" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="FNOSC" edc:desc="Oscillator Selection bits" edc:mask="0x7" edc:name="FNOSC" edc:nzwidth="3">
              <edc:DCRFieldSemantic edc:cname="FRCDIV" edc:desc="Fast RC oscillator (FRC) with divide-by-N" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="PLL" edc:desc="Primary or FRC oscillator with PLL" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PRI" edc:desc="Primary oscillator (XT, HS, EC)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="SOSC" edc:desc="Low power secondary oscillator (SOSC)" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="LPRC" edc:desc="Low power RC oscillator (LPRC)" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="PLLSRC" edc:desc="System PLL Input Clock Selection bit" edc:mask="0x1" edc:name="PLLSRC" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="PRI" edc:desc="Primary oscillator is selected as PLL reference input on device reset" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="FRC" edc:desc="FRC oscillator is selected as PLL reference input on device reset" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="SOSCEN" edc:desc="Secondary Oscillator Enable bit" edc:mask="0x1" edc:name="SOSCEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Secondary oscillator is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Secondary oscillator is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IESO" edc:desc="Two Speed Startup Enable bit" edc:mask="0x1" edc:name="IESO" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Two speed startup is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Two speed startup is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="POSCMOD" edc:desc="Primary Oscillator Selection bit" edc:mask="0x3" edc:name="POSCMOD" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="EC" edc:desc="External clock mode is selected" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="XT" edc:desc="XT oscillator mode is selected" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="HS" edc:desc="HS oscillator mode is selected" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Primary oscillator is disabled" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="OSCIOFNC" edc:desc="System Clock on CLKO Pin Enable bit" edc:mask="0x1" edc:name="OSCIOFNC" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="System clock is connected to CLKO/OSC2 pin" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="OSCO pin operates as a normal I/O" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="SOSCSEL" edc:desc="Secondary Oscillator External Clock Enable bit" edc:mask="0x1" edc:name="SOSCSEL" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="SOSC pins configured for Crystal mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="SCLKI pin configured for Digital mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="FCKSM" edc:desc="Clock Switching and Fail-Safe Clock Monitor Enable bits" edc:mask="0x3" edc:name="FCKSM" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="CSDCMD" edc:desc="Clock switching is disabled; Fail-safe clock monitor is disabled" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="CSECMD" edc:desc="Clock switching is enabled; Fail-safe clock monitor is disabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CSDCME" edc:desc="Clock switching is disabled; Fail-safe clock monitor is enabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="CSECME" edc:desc="Clock switching is enabled; Fail-safe clock monitor is enabled" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC01758" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="SABD_32bit.DCRModule" edc:_refcount="1" edc:access="n-------------------------------" edc:cname="AFSEC" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x80000000" edc:name="AFSEC" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x7FFFFFFF">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="31"/>
            <edc:DCRFieldDef edc:cname="CP" edc:desc="Code Protection Enable bit" edc:mask="0x1" edc:name="CP" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Code protection is enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0" edc:checksumalgo="0x80" edc:endaddr="0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Code protection is disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0" edc:checksumalgo="0" edc:endaddr="0"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:AdjustPoint edc:_addr="0x1FC0175C" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="SABD_32bit.DCRModule" edc:_refcount="1" edc:offset="0x4"/>
      <edc:DCRDef edc:_addr="0x1FC01760" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="SABD_32bit.DCRModule" edc:_refcount="1" edc:access="n-------------------------------" edc:cname="AFSIGN" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x80000000" edc:ishidden="true" edc:isidehidden="true" edc:islanghidden="true" edc:name="AFSIGN" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="31"/>
            <edc:DCRFieldDef edc:cname="SIGN" edc:desc="" edc:ishidden="false" edc:isidehidden="false" edc:islanghidden="false" edc:mask="0x1" edc:name="SIGN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="Reserved" edc:desc="This bit must be programmed to zero" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:AltConfigFuseSector>
    <edc:GPRDataSector edc:beginaddr="0x0" edc:endaddr="0x8000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="0" edc:kuseg="0x7f000000" edc:regionid="kseg0_data_mem"/>
    <edc:SFRDataSector edc:beginaddr="0x1f800000" edc:endaddr="0x1f808000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="1" edc:regionid="periph0">
      <edc:SFRDef edc:_addr="0x1F800000" edc:_begin="0x0" edc:_end="0x20" edc:_modsrc="DOS-02050_tmr_rtcc_upb_v1_32bit.Module" edc:_refcount="1" edc:access="nn--nnnnnnnnnnnnnn--n---nnnn----" edc:cname="RTCCON1" edc:desc="" edc:grp="RTCC" edc:impl="0xffffd8f0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--00000000000000--0---0000----" edc:name="RTCCON1" edc:nzwidth="0x20" edc:por="00--00000000000000--0---0000----" edc:portals="CLR SET INV" ltx:baseofperipheral="RTCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="OUTSEL" edc:desc="" edc:mask="0x7" edc:name="OUTSEL" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="RTCOE" edc:desc="" edc:mask="0x1" edc:name="RTCOE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="WRLOCK" edc:desc="" edc:mask="0x1" edc:name="WRLOCK" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ALMRPT" edc:desc="" edc:mask="0xff" edc:name="ALMRPT" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="AMASK" edc:desc="" edc:mask="0xf" edc:name="AMASK" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="CHIME" edc:desc="" edc:mask="0x1" edc:name="CHIME" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ALRMEN" edc:desc="" edc:mask="0x1" edc:name="ALRMEN" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="REAL TIME CLOCK" edc:pos="14"/>
      </edc:SFRDef>
