Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/edc/PIC32MM0256GPM028.PIC
      <edc:SFRDef edc:_addr="0x1F802B50" edc:_begin="0x360" edc:_end="0x4d0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="2" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="RPOR4" edc:desc="" edc:impl="0x1f1f1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="RPOR4" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RP17R" edc:desc="" edc:mask="0x1f" edc:name="RP17R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RP18R" edc:desc="" edc:mask="0x1f" edc:name="RP18R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RP19R" edc:desc="" edc:mask="0x1f" edc:name="RP19R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RP20R" edc:desc="" edc:mask="0x1f" edc:name="RP20R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802B60" edc:_begin="0x360" edc:_end="0x4d0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="2" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="RPOR5" edc:desc="" edc:impl="0xf87820df" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu---uuuuu---uuuuu---uuuuu" edc:name="RPOR5" edc:nzwidth="32" edc:por="---xxxxx---xxxxx---xxxxx---xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RP21R" edc:mask="0x1f" edc:name="RP21R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RP22R" edc:mask="0x1f" edc:name="RP22R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RP23R" edc:mask="0x1f" edc:name="RP23R" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RP24R" edc:mask="0x1f" edc:name="RP24R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F802B70" edc:offset="0x40"/>
      <edc:SFRDef edc:_addr="0x1F802BB0" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="----------------------------nnnn" edc:cname="ANSELA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff000f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------1111" edc:name="ANSELA" edc:nzwidth="0x20" edc:por="----------------------------1111" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ANSA0" edc:desc="" edc:mask="0x1" edc:name="ANSA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSA1" edc:desc="" edc:mask="0x1" edc:name="ANSA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSA2" edc:desc="" edc:mask="0x1" edc:name="ANSA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSA3" edc:desc="" edc:mask="0x1" edc:name="ANSA3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802BC0" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="---------------------------nnnnn" edc:cname="TRISA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff001f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------11111" edc:name="TRISA" edc:nzwidth="0x20" edc:por="---------------------------11111" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISA0" edc:desc="" edc:mask="0x1" edc:name="TRISA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA1" edc:desc="" edc:mask="0x1" edc:name="TRISA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA2" edc:desc="" edc:mask="0x1" edc:name="TRISA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA3" edc:desc="" edc:mask="0x1" edc:name="TRISA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA4" edc:desc="" edc:mask="0x1" edc:name="TRISA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802BD0" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="---------------------------nnnnn" edc:cname="PORTA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff001f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------xxxxx" edc:name="PORTA" edc:nzwidth="0x20" edc:por="---------------------------xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RA0" edc:desc="" edc:mask="0x1" edc:name="RA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA1" edc:desc="" edc:mask="0x1" edc:name="RA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA2" edc:desc="" edc:mask="0x1" edc:name="RA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA3" edc:desc="" edc:mask="0x1" edc:name="RA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA4" edc:desc="" edc:mask="0x1" edc:name="RA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802BE0" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="---------------------------nnnnn" edc:cname="LATA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff001f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="LATA" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATA0" edc:desc="" edc:mask="0x1" edc:name="LATA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA1" edc:desc="" edc:mask="0x1" edc:name="LATA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA2" edc:desc="" edc:mask="0x1" edc:name="LATA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA3" edc:desc="" edc:mask="0x1" edc:name="LATA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA4" edc:desc="" edc:mask="0x1" edc:name="LATA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802BF0" edc:_begin="0x4d0" edc:_end="0x8b0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="3" edc:access="---------------------------nnnnn" edc:cname="ODCA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff001f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="ODCA" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCA0" edc:desc="" edc:mask="0x1" edc:name="ODCA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA1" edc:desc="" edc:mask="0x1" edc:name="ODCA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA2" edc:desc="" edc:mask="0x1" edc:name="ODCA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA3" edc:desc="" edc:mask="0x1" edc:name="ODCA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA4" edc:desc="" edc:mask="0x1" edc:name="ODCA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
