Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/edc/PIC32MM0256GPM028.PIC
      <edc:SFRDef edc:_addr="0x1F808C20" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="5" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="DCH3DPTR" edc:desc="" edc:grp="DMAC0" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="DCH3DPTR" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHDPTR" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="CHDPTR" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F808C30" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="5" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="DCH3CSIZ" edc:desc="" edc:grp="DMAC0" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="DCH3CSIZ" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHCSIZ" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="CHCSIZ" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F808C40" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="5" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="DCH3CPTR" edc:desc="" edc:grp="DMAC0" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="DCH3CPTR" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHCPTR" edc:desc="" edc:islanghidden="true" edc:mask="0xFFFF" edc:name="CHCPTR" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F808C50" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="5" edc:access="------------------------nnnnnnnn" edc:cname="DCH3DAT" edc:desc="" edc:grp="DMAC0" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------xxxxxxxx" edc:name="DCH3DAT" edc:nzwidth="0x20" edc:por="------------------------xxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCHPDAT" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="DCHPDAT" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F808C60" edc:offset="0x63A0"/>
      <edc:SFRDef edc:_addr="0x1F80F000" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="---------nnnnnnn-n-n-nnn---nnnnn" edc:cname="INTCON" edc:desc="" edc:impl="0x7f571f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------0000000-x-0-000---00000" edc:name="INTCON" edc:nzwidth="32" edc:por="---------0000000-x-0-000---00000" edc:portals="CLR SET INV" ltx:baseofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INT0EP" edc:desc="" edc:mask="0x1" edc:name="INT0EP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT1EP" edc:desc="" edc:mask="0x1" edc:name="INT1EP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT2EP" edc:desc="" edc:mask="0x1" edc:name="INT2EP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT3EP" edc:desc="" edc:mask="0x1" edc:name="INT3EP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT4EP" edc:desc="" edc:mask="0x1" edc:name="INT4EP" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="TPC" edc:desc="" edc:mask="0x7" edc:name="TPC" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="MVEC" edc:desc="" edc:mask="0x1" edc:name="MVEC" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VS" edc:desc="" edc:mask="0x7f" edc:name="VS" edc:nzwidth="7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F010" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="---n---n---n---n---n---n---n---n" edc:cname="PRISS" edc:desc="" edc:impl="0x11111111" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---u---u---u---u---u---u---u---u" edc:name="PRISS" edc:nzwidth="32" edc:por="---x---x---x---x---x---x---x---x" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SEVCSS" edc:mask="0x1" edc:name="SEVCSS" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PRI1SS" edc:mask="0x1" edc:name="PRI1SS" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="PRI2SS" edc:mask="0x1" edc:name="PRI2SS" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="PRI3SS" edc:mask="0x1" edc:name="PRI3SS" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="PRI4SS" edc:mask="0x1" edc:name="PRI4SS" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="PRI5SS" edc:mask="0x1" edc:name="PRI5SS" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="PRI6SS" edc:mask="0x1" edc:name="PRI6SS" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="PRI7SS" edc:mask="0x1" edc:name="PRI7SS" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F020" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="---------------------rrrrrrrrrrr" edc:cname="INTSTAT" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------00000000000" edc:name="INTSTAT" edc:nzwidth="32" edc:por="---------------------00000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SIRQ" edc:desc="" edc:mask="0xff" edc:name="SIRQ" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="SRIPL" edc:desc="" edc:mask="0x7" edc:name="SRIPL" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F030" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IPTMR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="IPTMR" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IPTMR" edc:desc="" edc:mask="0xffffffff" edc:name="IPTMR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F040" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="--n---nn----nnn-----nnnnnnnnnnnn" edc:cname="IFS0" edc:desc="" edc:impl="0x238e0fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--0---000---000-----000000000000" edc:name="IFS0" edc:nzwidth="32" edc:por="--0---000---000-----000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CTIF" edc:desc="" edc:mask="0x1" edc:name="CTIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CS0IF" edc:desc="" edc:mask="0x1" edc:name="CS0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CS1IF" edc:desc="" edc:mask="0x1" edc:name="CS1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT0IF" edc:desc="" edc:mask="0x1" edc:name="INT0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT1IF" edc:desc="" edc:mask="0x1" edc:name="INT1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT2IF" edc:desc="" edc:mask="0x1" edc:name="INT2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT3IF" edc:desc="" edc:mask="0x1" edc:name="INT3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT4IF" edc:desc="" edc:mask="0x1" edc:name="INT4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNAIF" edc:desc="" edc:mask="0x1" edc:name="CNAIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNBIF" edc:desc="" edc:mask="0x1" edc:name="CNBIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNCIF" edc:desc="" edc:mask="0x1" edc:name="CNCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNDIF" edc:desc="" edc:mask="0x1" edc:name="CNDIF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="T1IF" edc:desc="" edc:mask="0x1" edc:name="T1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T2IF" edc:desc="" edc:mask="0x1" edc:name="T2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T3IF" edc:desc="" edc:mask="0x1" edc:name="T3IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CMP1IF" edc:desc="" edc:mask="0x1" edc:name="CMP1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP2IF" edc:desc="" edc:mask="0x1" edc:name="CMP2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP3IF" edc:desc="" edc:mask="0x1" edc:name="CMP3IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="USBIF" edc:desc="" edc:mask="0x1" edc:name="USBIF" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F050" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="nnnn--nnnnnnnnn---nnnnnnnnnnnnnn" edc:cname="IFS1" edc:desc="" edc:impl="0xF3FE3FFF" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000--000000000---00000000000000" edc:name="IFS1" edc:nzwidth="32" edc:por="0000--000000000---00000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RTCCIF" edc:desc="" edc:mask="0x1" edc:name="RTCCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1IF" edc:desc="" edc:mask="0x1" edc:name="AD1IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LVDIF" edc:mask="0x1" edc:name="LVDIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLC1IF" edc:desc="" edc:mask="0x1" edc:name="CLC1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLC2IF" edc:desc="" edc:mask="0x1" edc:name="CLC2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLC3IF" edc:desc="" edc:mask="0x1" edc:name="CLC3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLC4IF" edc:desc="" edc:mask="0x1" edc:name="CLC4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1EIF" edc:desc="" edc:mask="0x1" edc:name="SPI1EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI1TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI1RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2EIF" edc:desc="" edc:mask="0x1" edc:name="SPI2EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI2TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI2RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI3EIF" edc:desc="" edc:mask="0x1" edc:name="SPI3EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI3TXIF" edc:mask="0x1" edc:name="SPI3TXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI3RXIF" edc:mask="0x1" edc:name="SPI3RXIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="U1RXIF" edc:mask="0x1" edc:name="U1RXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U1TXIF" edc:mask="0x1" edc:name="U1TXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U1EIF" edc:mask="0x1" edc:name="U1EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U2RXIF" edc:mask="0x1" edc:name="U2RXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U2TXIF" edc:mask="0x1" edc:name="U2TXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U2EIF" edc:mask="0x1" edc:name="U2EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U3RXIF" edc:mask="0x1" edc:name="U3RXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U3TXIF" edc:mask="0x1" edc:name="U3TXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U3EIF" edc:mask="0x1" edc:name="U3EIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F060" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="nn-nnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IFS2" edc:desc="" edc:impl="0xdfffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0u-00000000000000000000000000000" edc:name="IFS2" edc:nzwidth="32" edc:por="0x-00000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C1SIF" edc:mask="0x1" edc:name="I2C1SIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C1MIF" edc:mask="0x1" edc:name="I2C1MIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C1BCIF" edc:mask="0x1" edc:name="I2C1BCIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C2SIF" edc:mask="0x1" edc:name="I2C2SIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C2MIF" edc:mask="0x1" edc:name="I2C2MIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C2BCIF" edc:mask="0x1" edc:name="I2C2BCIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C3SIF" edc:mask="0x1" edc:name="I2C3SIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C3MIF" edc:mask="0x1" edc:name="I2C3MIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C3BCIF" edc:mask="0x1" edc:name="I2C3BCIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCP1IF" edc:mask="0x1" edc:name="CCP1IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCT1IF" edc:mask="0x1" edc:name="CCT1IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCP2IF" edc:mask="0x1" edc:name="CCP2IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCT2IF" edc:mask="0x1" edc:name="CCT2IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCP3IF" edc:mask="0x1" edc:name="CCP3IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCT3IF" edc:mask="0x1" edc:name="CCT3IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCP4IF" edc:mask="0x1" edc:name="CCP4IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCT4IF" edc:mask="0x1" edc:name="CCT4IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCP5IF" edc:mask="0x1" edc:name="CCP5IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCT5IF" edc:mask="0x1" edc:name="CCT5IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCP6IF" edc:mask="0x1" edc:name="CCP6IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCT6IF" edc:mask="0x1" edc:name="CCT6IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCP7IF" edc:mask="0x1" edc:name="CCP7IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCT7IF" edc:mask="0x1" edc:name="CCT7IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCP8IF" edc:mask="0x1" edc:name="CCP8IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCT8IF" edc:mask="0x1" edc:name="CCT8IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCP9IF" edc:mask="0x1" edc:name="CCP9IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCT9IF" edc:mask="0x1" edc:name="CCT9IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSTIF" edc:mask="0x1" edc:name="FSTIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="NVMIF" edc:mask="0x1" edc:name="NVMIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPCIF" edc:mask="0x1" edc:name="CPCIF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80F070" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="--------------------------nnnnn-" edc:cname="IFS3" edc:desc="" edc:impl="0xffffff3e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000000000000000000--u0000-" edc:name="IFS3" edc:nzwidth="32" edc:por="000000000000000000000000--x0000-" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ECCBEIF" edc:mask="0x1" edc:name="ECCBEIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA0IF" edc:mask="0x1" edc:name="DMA0IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA1IF" edc:mask="0x1" edc:name="DMA1IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA2IF" edc:mask="0x1" edc:name="DMA2IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA3IF" edc:mask="0x1" edc:name="DMA3IF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F80F080" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:offset="0x40"/>
      <edc:SFRDef edc:_addr="0x1F80F0C0" edc:_begin="0x0" edc:_end="0x2e0" edc:_modsrc="DOS-02922_SABD_32bit.Module" edc:_refcount="6" edc:access="--n---nn----nnn-----nnnnnnnnnnnn" edc:cname="IEC0" edc:desc="" edc:impl="0x238e0fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--u---000---000-----000000000000" edc:name="IEC0" edc:nzwidth="32" edc:por="--x---000---000-----000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CTIE" edc:desc="" edc:mask="0x1" edc:name="CTIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CS0IE" edc:desc="" edc:mask="0x1" edc:name="CS0IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CS1IE" edc:desc="" edc:mask="0x1" edc:name="CS1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT0IE" edc:desc="" edc:mask="0x1" edc:name="INT0IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT1IE" edc:desc="" edc:mask="0x1" edc:name="INT1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT2IE" edc:desc="" edc:mask="0x1" edc:name="INT2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT3IE" edc:desc="" edc:mask="0x1" edc:name="INT3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT4IE" edc:desc="" edc:mask="0x1" edc:name="INT4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNAIE" edc:desc="" edc:mask="0x1" edc:name="CNAIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNBIE" edc:desc="" edc:mask="0x1" edc:name="CNBIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNCIE" edc:desc="" edc:mask="0x1" edc:name="CNCIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNDIE" edc:desc="" edc:mask="0x1" edc:name="CNDIE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="T1IE" edc:desc="" edc:mask="0x1" edc:name="T1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T2IE" edc:desc="" edc:mask="0x1" edc:name="T2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T3IE" edc:desc="" edc:mask="0x1" edc:name="T3IE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CMP1IE" edc:desc="" edc:mask="0x1" edc:name="CMP1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP2IE" edc:desc="" edc:mask="0x1" edc:name="CMP2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP3IE" edc:desc="" edc:mask="0x1" edc:name="CMP3IE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="USBIE" edc:mask="0x1" edc:name="USBIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
